#+BEGIN_EXPORT html
---
layout: page
title: Flask Sessions
tagline: " Effortless User State Management, Secure and Simple."
permalink: /python/flask/sessions.html
categories: [Python, Flask]
tags: [python, flask, sessions]
---
#+END_EXPORT
#+STARTUP: showall indent
#+OPTIONS: tags:nil num:nil \n:nil @:t ::t |:t ^:{} _:{} *:t
#+PROPERTY: header-args :exports both
#+PROPERTY: header-args+ :results output pp
#+PROPERTY: header-args+ :eval no-export
#+TOC: headlines 2

* Preamble

In modern web development, maintaining user-specific data across
multiple requests is crucial for creating a seamless and personalized
user experience. Flask sessions provide a robust solution to this need
by enabling effortless and secure management of user state. By
leveraging client-side storage with server-side integrity checks,
Flask sessions ensure that user data remains consistent and
tamper-proof throughout their interaction with the application. This
approach not only simplifies the process of storing and retrieving
session data but also enhances the overall security and functionality
of web applications.

* What are Sessions?

Flask /Sessions/ are a mechanism to store user-specific data across
multiple requests securely and effortlessly, using client-side cookies
signed with a secret key to ensure data integrity.

* Why are Sessions Important?

- *State Management:* HTTP is a stateless protocol, meaning it doesn't
  retain any information about previous requests. Sessions help
  maintain state by allowing the server to remember information about
  a client's interactions;
- *User Experience:* Sessions enable features like user login,
  shopping carts, and customization, enhancing the user's experience
  on the website.

* How Sessions Works in Flask?

Flask provides a simple way to manage sessions using cookies.
/A cookie/ is a small piece of data stored on the user's
browser. Flask uses cookies to store session data on the client side
while keeping the data secure and tamper-proof using a secret key.

- *Session Cookie:* A cookie stored in the user's browser that holds
  a session identifier;
- *Secret Key:* A key used by Flask to sign the session data, ensuring
  it can detect any tampering;
- *Session Object:* A global object in Flask used to store and
  retrieve session data.

* Example

#+begin_src sh :results verbatim
  tree ~/git/annelida/ballyboe/practice/session_flask
#+end_src

#+RESULTS:
: /home/vikky/git/annelida/ballyboe/practice/session_flask
: └── app.py
:
: 1 directory, 1 file

#+begin_src sh
  cd ~/git/annelida/ballyboe/practice/session_flask
  cat app.py
#+end_src

#+RESULTS:
#+begin_example
from flask import Flask, session, redirect, url_for, request

app = Flask(__name__)
app.secret_key = 'supersecretkey'  # Secret key used to sign session cookies

@app.route('/')
def index():
    if 'username' in session:
        username = session['username']
        return f'Logged in as {username} <br><a href="/logout">Logout</a>'
    return 'You are not logged in <br><a href="/login">Login</a>'

@app.route('/login', methods=['GET', 'POST'])
def login():
    if request.method == 'POST':
        session['username'] = request.form['username']
        return redirect(url_for('index'))
    return '''
        <form method="post">
            <p><input type=text name=username>
            <p><button type=submit>Login</button>
        </form>
    '''

@app.route('/logout')
def logout():
    session.pop('username', None)
    return redirect(url_for('index'))

if __name__ == '__main__':
      app.run(debug=True)


#+end_example

* Conclusion
